In [ ]:
# here you are going to write a code | Set of intruction

In [ ]:
# Cheat sheet - Short Cuts of jupyter


# In Python 


# Commenting has to be done with the 

# ----------------------------- 
# making a piece of your code inactive
# mutlilin commenting 
# [ctrl + /]

# this is the very first time I am getting my hands dirty
## sub heading
#### sub sub heading

~~striking 

normal text
code is below
3+7

In [2]:
3+7

10

In [6]:
3+5

8

In [20]:
# Some basic rules of programing in Python | to create the objects
#____________________________________________________________

X_x1 = 3 + 5
9xx1  = 10
print(X_x1)
print(9xx1)

SyntaxError: invalid syntax (<ipython-input-20-98a0690d781d>, line 5)

In [16]:
X = 5 + 10

8

In [9]:
# BASIC RULES FOR INC : INDENTIFIER NAMING CONVENTIONS
#-----------------------------------------------------------
# 1- : its a case sensitive Language
# 2-: its not a syntax free language
# 3 : Any name could be alphanumeric [A-Z | a-z | 0-9| _]
# 4: Object(variable) should not start other then alphabet

8

In [ ]:
# OPERATORS AND OPERANDS

#________________________________________
# MATHEMATICAL ARITHMATIC  : + - * / % ** () //

# lOGICAL OPERATOR : AND & OR |  NOT ! 

# RELATIONAL OPERATOR/ CONDITIONAL OPERATOR : < > <= >= == != <>

# ASSIGNMENT OPERATOR  [=]

In [27]:
X = 2>5
type(X)
#print(X)

bool

In [ ]:
# DATA TYPES: 
# BASE python ---  pandas --- numpy
# _____________________________________
int -----------  int64     -- INT
float ---------- float64   -- FLOAT
str ------------ object
complex--------- NA
bool ----------- bool64
NA ------------- DATETIME64

# DATA structres: 

# BASE python --- pandas -- numpy 
*tupple ---------- SERIES    NDAARY
****list              DATAFRAME NDARRAY(2)
**set
***dictionary

In [78]:
# x = 10

# multile elements of same or different dataypes in 1d or 2d manner

#Base python data structures :1D heterogenous  DS
# tupple: () | immutable - its values can not be changes

t1=(12,34,4,556,67,"a") 
type(t1)

len(t1)

6

In [46]:
# Indexing - its feature in Python and R with the help 
#    of which we can slice, dice, filter the data
# t1[ element position<0-(n-1)     ]
t1[1] = 999

TypeError: 'tuple' object does not support item assignment

In [51]:
# list: [] | mutable - can be changes
l1 = [12,34,4,556,67,"a"]
l1

NameError: name 'L1' is not defined

In [49]:
l1[2] = 999
l1

[12, 34, 999, 556, 67, 'a']

In [52]:
# SET : {} | this is ordered, unique DS (SET Theory)
# This is used to handle the data from two different DS
s1 = {12,34,55,66,77,89,12,34}
s1

{12, 34, 55, 66, 77, 89}

In [56]:
# Dictionary : DS with the combination of Key | Values
dict1 = {'ename': 'rahul'}



dict2 = {'ename': ['rahul','Ram','Shyam']}
dict2

{'ename': ['rahul', 'Ram', 'Shyam']}

In [73]:
x = 8
y = 10
z = 10.5
c = 5+10j
s1 = "mango"
s2 = 'banana'

In [69]:
s.upper()

'MANGO'

In [72]:
c.real

5.0

In [74]:
print(dir(s1))

['__add__', '__class__', '__contains__', '__delattr__', '__dir__', '__doc__', '__eq__', '__format__', '__ge__', '__getattribute__', '__getitem__', '__getnewargs__', '__gt__', '__hash__', '__init__', '__init_subclass__', '__iter__', '__le__', '__len__', '__lt__', '__mod__', '__mul__', '__ne__', '__new__', '__reduce__', '__reduce_ex__', '__repr__', '__rmod__', '__rmul__', '__setattr__', '__sizeof__', '__str__', '__subclasshook__', 'capitalize', 'casefold', 'center', 'count', 'encode', 'endswith', 'expandtabs', 'find', 'format', 'format_map', 'index', 'isalnum', 'isalpha', 'isdecimal', 'isdigit', 'isidentifier', 'islower', 'isnumeric', 'isprintable', 'isspace', 'istitle', 'isupper', 'join', 'ljust', 'lower', 'lstrip', 'maketrans', 'partition', 'replace', 'rfind', 'rindex', 'rjust', 'rpartition', 'rsplit', 'rstrip', 'split', 'splitlines', 'startswith', 'strip', 'swapcase', 'title', 'translate', 'upper', 'zfill']

In [75]:
print(dir(s2))

['__add__', '__class__', '__contains__', '__delattr__', '__dir__', '__doc__', '__eq__', '__format__', '__ge__', '__getattribute__', '__getitem__', '__getnewargs__', '__gt__', '__hash__', '__init__', '__init_subclass__', '__iter__', '__le__', '__len__', '__lt__', '__mod__', '__mul__', '__ne__', '__new__', '__reduce__', '__reduce_ex__', '__repr__', '__rmod__', '__rmul__', '__setattr__', '__sizeof__', '__str__', '__subclasshook__', 'capitalize', 'casefold', 'center', 'count', 'encode', 'endswith', 'expandtabs', 'find', 'format', 'format_map', 'index', 'isalnum', 'isalpha', 'isdecimal', 'isdigit', 'isidentifier', 'islower', 'isnumeric', 'isprintable', 'isspace', 'istitle', 'isupper', 'join', 'ljust', 'lower', 'lstrip', 'maketrans', 'partition', 'replace', 'rfind', 'rindex', 'rjust', 'rpartition', 'rsplit', 'rstrip', 'split', 'splitlines', 'startswith', 'strip', 'swapcase', 'title', 'translate', 'upper', 'zfill']

In [ ]:
t1
l1
s1
dict1

In [85]:
l1.insert(3,99999)

In [89]:
print(dir(dict1))

['__class__', '__contains__', '__delattr__', '__delitem__', '__dir__', '__doc__', '__eq__', '__format__', '__ge__', '__getattribute__', '__getitem__', '__gt__', '__hash__', '__init__', '__init_subclass__', '__iter__', '__le__', '__len__', '__lt__', '__ne__', '__new__', '__reduce__', '__reduce_ex__', '__repr__', '__setattr__', '__setitem__', '__sizeof__', '__str__', '__subclasshook__', 'clear', 'copy', 'fromkeys', 'get', 'items', 'keys', 'pop', 'popitem', 'setdefault', 'update', 'values']

#### Packages | libraries

In [90]:
import pandas as pd

In [91]:
hr = pd.read_csv("C:\\Users\\aagarwal\\Desktop\\DataSetsR\\Human Resource_employees2.csv")

In [94]:
df1 = pd.read_excel("C:\\Users\\aagarwal\\Desktop\\DataSetsR\\Sample - Superstore.xls", header=0)

In [97]:
df2 = pd.read_excel("C:\\Users\\aagarwal\\Desktop\\DataSetsR\\Sample - Superstore.xls", header=1)

In [110]:
l1 = [12, 34, 4, 99999, 556, 67,"a"]

ser1 = pd.Series(l1)



l2 = [12, 34, 4, 99999, 556, 67]

ser2 = pd.Series(l2)

In [108]:
type(ser1)

pandas.core.series.Series

In [112]:
ser1

0       12
1       34
2        4
3    99999
4      556
5       67
6        a
dtype: object

In [113]:
import numpy as np

In [60]:
import pandas as pd

In [4]:
# pd.read_csv Sheetname argument will not be there ofcourse
# pd.read_excel | sheetname
type(hr.DESIGNATION)

pandas.core.series.Series

In [10]:
hr = pd.read_csv("C:\\Users\\aagarwal\\Desktop\\DataSetsR\\Human Resource_employees2.csv")

In [14]:
# EDA - Understanding the data.
# All those activites with the help of which I can understand the data in detail:
    
hr.shape
hr.columns
hr.head()
hr.tail()
hr.info()
hr.describe()
hr.describe().T
hr.get_dtype_counts()

hr.DESIGNATION.clip_upper? Google | stackoverflow

# ....... look for the other relative funtionalities so that you can understand the data further...

float64    4
int64      2
object     7
dtype: int64

In [17]:
# Data manipulations

# How to access the data
hr.DESIGNATION.head()

# Indexing concept on Dataset - 2D Object [<Row level conditional> , <Column level> ]

0      Analyst
1    Associate
2      Analyst
3      Analyst
4      Analyst
Name: DESIGNATION, dtype: object

In [29]:
hr.columns

Index(['FIRST NAME', 'LAST NAME', 'SEX', 'DOJ', 'CURRENT DATE', 'DESIGNATION',
       'AGE', 'SALARY', 'UNIT', 'LEAVES USED', 'LEAVES REMAINING', 'RATINGS',
       'PAST EXP'],
      dtype='object')

In [30]:

hr.loc[ hr.DESIGNATION=="Analyst"  , ["FIRST NAME","DESIGNATION", "SALARY"]    ]

     FIRST NAME DESIGNATION  SALARY
0        TOMASA     Analyst   44570
2         OLIVE     Analyst   40955
3        CHERRY     Analyst   45550
4          LEON     Analyst   43161
5      VICTORIA     Analyst   48736
6        ELLIOT     Analyst   40339
7       JACQUES     Analyst   40058
9        LILIAN     Analyst   43110
10        BELLE     Analyst   41590
12       WELDON     Analyst   44828
13         BOYD     Analyst   45830
14         BART     Analyst   43457
15      CORINNE     Analyst   44812
16       ALONZO     Analyst   47636
17        ROYCE     Analyst   48651
18       BURTON     Analyst   40411
19      PHILLIP     Analyst   44665
20      ORVILLE     Analyst   46941
21         KORY     Analyst   47734
22       NETTIE     Analyst   40541
23        WENDI     Analyst   43920
24        BRENT     Analyst   45832
25    HARRIETTE     Analyst   48102
26      GARLAND     Analyst   48662
27      OSWALDO     Analyst   49685
29      ROXANNE     Analyst   45410
30        CLAUD     Analyst   43030
31     MARIANNA     Analyst   42388
34         TORI     Analyst   47008
35       KELLEY     Analyst   49898
...         ...         ...     ...
2602      CLARK     Analyst   41222
2604     ALTHEA     Analyst   42250
2605      KYLIE     Analyst   49075
2606   TERRANCE     Analyst   49217
2609    ANTONIO     Analyst   43228
2612      MAMIE     Analyst   46432
2613      DINAH     Analyst   44599
2614     KELLIE     Analyst   42418
2615       LINA     Analyst   41498
2616   WINIFRED     Analyst   41515
2617     JEANNA     Analyst   48541
2619     KENDRA     Analyst   44676
2620      MOLLY     Analyst   41378
2621   PATRICIA     Analyst   42369
2622      AUDRA     Analyst   42662
2623         JC     Analyst   41760
2624     JOSPEH     Analyst   45364
2625    FRANCES     Analyst   49892
2626        LEE     Analyst   49617
2627      ROBYN     Analyst   42877
2628       DREW     Analyst   48866
2629     RICKIE     Analyst   47849
2630      ELVIA     Analyst   44424
2631      BILLY     Analyst   43884
2632    MARLENE     Analyst   43835
2633      ALENE     Analyst   40277
2635     LOUISE     Analyst   45758
2636      RENEE     Analyst   47315
2637       TERI     Analyst   45172
2638    GREGORY     Analyst   49176

[1949 rows x 3 columns]

In [21]:
l2 = [12, 34, 4, 99,29,9, 5,56, 67]

ser2 = pd.Series(l2)
ser3 = pd.Series(l2, index =("a","b","c","d","e","f","g","h","i"))

In [28]:
ser3.loc["d"]
ser3>50

ser3.loc[ser3>50]

d    99
h    56
i    67
dtype: int64

In [19]:
ilocs - actual indexing - 0 -n-1 default
ser2

0    12
1    34
2     4
3    99
4    29
5     9
6     5
7    56
8    67
dtype: int64

In [36]:
# How to add a new column

# hr.dummy = "Check"

#1st - Method 
hr["Dummy"] = "Check"

#2nd Method
hr = hr.assign(TAX = hr.SALARY *.10)

hr.head(2)

hr.assign?

In [39]:
hr.columns

Index(['FIRST NAME', 'LAST NAME', 'SEX', 'DOJ', 'CURRENT DATE', 'DESIGNATION',
       'AGE', 'SALARY', 'UNIT', 'LEAVES USED', 'LEAVES REMAINING', 'RATINGS',
       'PAST EXP', 'Dummy', 'TAX'],
      dtype='object')

In [41]:
# Subsetting the columns : []
hr1 = hr[["FIRST NAME","LAST NAME","SEX"]]     
hr1.head(2)    

# drop or delete the columns

  FIRST NAME LAST NAME SEX
0     TOMASA     ARMEN   F
1      ANNIE       NaN   F

In [ ]:
# Deleting the Variables

#1 
#hr = hr.drop(columns = ["Dummy1","Dummy_str","TAX"])

#hr = stores.drop(["Dummy1","Dummy_str","dummy3"], axis = 1)

# 2

del(hr["TAX"])
#stores.head(2)

In [ ]:
# stores.loc[rows locs/ conditions , columns names]
hr.loc[:,["DESGINATION","SALARY", "SEX"]]

# stores.iloc[rows indexing , columns indexing]
stores.iloc[[0,1,2,10],[0,3,4,5]]
stores.iloc[:,[0,3,4,5]]


# HW : get a new dataframe created with only Odd rows from teh original dataset

In [49]:
#### SORTING  - ORDERING THE DATA INTO ASCENDING OR IN DESCENDING
#             ONE OR MORE THE ONE COLUMS
    
hr.sort_values(["SALARY"])    # Ascending 

dt.sort_values(["SALES"], ascending = False)# Ascending 

dt.sort_values(["DESIGNATOION""SALES"], ascending = False)

# HW: Find the wasy with the help of which You can get the data sorted in descending on 
#     DESIGNATION and ascending on SALES

In [50]:
# Grouping : 
# merging | joins
# Appending | UNIONS

hr.groupby?
hr.merge?

Data Combination: 

# my data to be added vertically | merging(SAS| R|Python) | Join(sql) | Vlookup(excel)**
# merging : Adding one or more then one column aded from one table to another table
#     based on common variable's matched value

or
horizontally

In [1]:
import os

#Creating the Working Directory:
os.chdir("C:\\Users\\aagarwal\\Desktop\\DataSetsR") #setwd() function of R
os.getcwd()# getwd() in R

'C:\\Users\\aagarwal\\Desktop\\DataSetsR'

In [2]:
## Merging the data
#_______________________________________________________________________________________

# Importing the two files LeftR and rightR

import pandas as pd

LT = pd.read_csv("LeftR.csv")
RT = pd.read_csv("RightR.csv")

In [5]:
pd.merge?

In [9]:
pd.merge(left = LT,
        right = RT,
        left_on=["ID"],
        right_on=['C.ID'],
         how ='outer'
             )

    ID  Age C.ID   Addrss
0   C1   A1   C1    Noida
1   C2   A2   C2       d1
2   C2   A2   C2      D11
3   C2   A2   C2     D111
4   C3   A3   C3       d2
5   C4   A4   C4  Gurgaon
6   C5   A5  NaN      NaN
7  NaN  NaN   C6    Vizag

In [13]:
#### Grouping | groupby

# hr.groupby('UNIT').SALARY.sum()

hr.groupby('UNIT').SALARY.agg(['sum', 'mean']).reset_index()

# Task1: Find the Average Salary of Male and Female of each designation
# Task2: Find the Total and the Average Salary of Male and Female of each designation 
# Task3: Find the Total Salary and the Average Age of Male and Female of each designation in each UNIT

         UNIT       sum          mean
0     Finance  26135199  58599.100897
1          IT  27198128  58998.108460
2  Management  25154450  59186.941176
3   Marketing  25981304  59318.045662
4  Operations  24299332  55477.926941
5         Web  24654281  57202.508121

In [62]:
import pandas as pd

In [63]:
hr.head(2)

,FIRST NAME,LAST NAME,SEX,DOJ,CURRENT DATE,DESIGNATION,AGE,SALARY,UNIT,LEAVES USED,LEAVES REMAINING,RATINGS,PAST EXP
0,TOMASA,ARMEN,F,5-18-2014,01-07-2016,Analyst,21.0,44570,Finance,24.0,6.0,2.0,0
1,ANNIE,NaN,F,NaN,01-07-2016,Associate,NaN,89207,Web,NaN,13.0,NaN,7

In [64]:
hr.groupby('UNIT').SALARY.agg({'Total of SALARY': 'sum', 'Average of SALARY': 'mean'}).reset_index()

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: using a dict on a Series for aggregation
is deprecated and will be removed in a future version
  """Entry point for launching an IPython kernel.

         UNIT  Total of SALARY  Average of SALARY
0     Finance         26135199       58599.100897
1          IT         27198128       58998.108460
2  Management         25154450       59186.941176
3   Marketing         25981304       59318.045662
4  Operations         24299332       55477.926941
5         Web         24654281       57202.508121

In [69]:
hr2 = hr.loc[-hr.AGE.isna(),]

In [74]:
#hr2.shape

#hr.dropna

hr2.SEX.dropna?

In [15]:
#### Appending | Adding the row of one table below the another table | UNION ALL in SQL

DF1 = pd.read_csv("DF1.csv")
DF2 = pd.read_csv("DF2.csv")

DF2

   ID     Var2
0  C1    Noida
1  C2       d1
2  C3       d2
3  C4  Gurgaon
4  C6    Vizag

In [16]:
result = DF1.append(DF2, ignore_index = True)

result

C:\ProgramData\Anaconda3\lib\site-packages\pandas\core\frame.py:6201: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=True'.

To retain the current behavior and silence the warning, pass sort=False

  sort=sort)

   ID Var1     Var2
0  C1   A1      NaN
1  C2   A2      NaN
2  C3   A3      NaN
3  C4   A4      NaN
4  C5   A5      NaN
5  C1  NaN    Noida
6  C2  NaN       d1
7  C3  NaN       d2
8  C4  NaN  Gurgaon
9  C6  NaN    Vizag

In [18]:
df = [DF1, DF2]

# result = pd.concat(df, axis= 0) # Row wise appending

result = pd.concat(df, axis= 1) # column wise appending

result

   ID Var1  ID     Var2
0  C1   A1  C1    Noida
1  C2   A2  C2       d1
2  C3   A3  C3       d2
3  C4   A4  C4  Gurgaon
4  C5   A5  C6    Vizag

In [ ]:
# USER DEFINED FUNCTIONS:
UDF : User Defined Function : 
        The function which are defnied by us(user)								
        Your own function as per your requirement				

        1- Always takes the input as argument				
2- It process the statement:				
3- It always RETURN a value				


syntax:
# def func_name(arg1):
#     Statement1
#     statement2
#     return(y)

In [19]:
def sq_num(x):
    y= x**2
    return(y)

In [20]:
sq_num(2)

4

In [22]:
hr.describe().T

# Task: Here I am not having much of the other information with the describe function
#     So Create UDF with the name CAlled 'My_EDA' : along with the below details:
#             P1 P2 P5 P10 P90 P95 P98 P99
#             Lower CAp Mean-2.5*STD
#             Upper Cap meand + 2.5*STD
#             FLAG for each column for OUTLIER


You practically have to get such details for all the columns in a DF
HOw to apply this function on all the columns in a DF ? [ MAP | APPLY |MApApply]

,count,mean,std,min,25%,50%,75%,max
AGE,2636.0,24.756449,3.908228,21.0,22.0,24.0,25.0,45.0
SALARY,2639.0,58136.678287,36876.956944,40001.0,43418.0,46781.0,51401.5,388112.0
LEAVES USED,2636.0,22.501517,4.604469,15.0,19.0,22.0,26.0,30.0
LEAVES REMAINING,2637.0,7.503223,4.603193,0.0,4.0,8.0,11.0,15.0
RATINGS,2637.0,3.486159,1.114933,2.0,2.0,3.0,4.0,5.0
PAST EXP,2639.0,1.566881,2.728416,0.0,0.0,1.0,2.0,23.0

In [23]:
hr.SALARY.clip_lower
hr.SALARY.clip_upper

hr.SALARY.clip?